{
  "MENU": {
    "INICIO": "Inicio",
    "TECNOLOGIAS": "Tecnologías",
    "EXPERIENCIA": "Experiencia",
    "FORMACION": "Formación",
    "PROYECTOS": "Proyectos",
    "EXTRAS": "Extras"
  },
  "PROFILES":{
    "TITLE": "Desarrollador Full Stack | IA Developer",
    "WORK": "Disponible para trabajar",
    "ABOUT": "Sobre mí",
    "TEXT_LIST":[ 
      "Hola, soy Marcos Bazán, un apasionado desarrollador Full Stack con experiencia en IA y un enfoque en la ingeniería de software. Me encanta crear soluciones innovadoras y eficientes que mejoren la experiencia del usuario.",
      "Mi objetivo es seguir aprendiendo y creciendo en el campo de la tecnología, contribuyendo a proyectos que marquen la diferencia.",
      "¡Estoy disponible para colaborar en proyectos emocionantes!"
    ]

  },
  "TECNOLOGIAS": {
    "TITLE": "Tecnologías",
    "TOOLS": "Herramientas"
  },

  "EXPERIENCIA": {
    "TITLE": "Experiencia",
    "CodeArts-Solution":{
      "TITLE": "CodeArts Solution",
    "SUBTITLE": "Desarrollador Full Stack",
    "DATE": "Nov.2024 - Feb.2025",
    "TEXT_LIST":[ 
      " Desarrollo de una aplicación utilizando Drupal 11 para el frontend y Symfony con PHP para el backend.",
      "Implementación de funcionalidades como autenticación de usuarios, gestión de datos, creacion y personalización de módulos, temas y rutas."
    ]
  }},
  "LEARNING": {
    "TITLE": "Estudios",
    "CESUR": {
      "TITLE": "Cesur",
      "DATE": "Sep.2022 - Ene.2025",
      "DESC": "Desarrollo de Aplicaciones Multiplataforma."
    },
    "SANTAMARIA": {
      "TITLE": "Santa María de los Apóstoles",
      "DATE": "Sep.2020 - Jun.2022",
      "DESC": "Ciclo formativo en sistemas microinformáticos y redes."
    }
  },

"PROYECTOS": {
  "TITLE": "Proyectos",
  "VER_MAS": "Ver más",
  "VER_MENOS": "Ver menos",
  "TECNOLOGIAS": "Tecnologías usadas",
  "LIST": {
    "0": {
      "TITLE": "Portfolio Personal",
      "DESC": "Portfolio personal explicando lo aprendido y mi trayectoria profesional como desarrollador ademas de mis proyectos personales y cosas extras.",
      "LINK": "Ver en GitHub"
    },
    "1": {
      "TITLE": "Biblioteca",
      "DESC": "Una aplicación desarrollada en Java con Spring Boot destinada a gestionar el sistema de una biblioteca: préstamos, libros, usuarios, etc... y con una base de datos PostgreSQL.",
      "LINK": "Ver en GitHub"
    },
    "2": {
      "TITLE": "Nominator",
      "DESC": "Aplicación de escritorio en Python para la gestión de nóminas, altas/bajas y generación de informes en formato pdf, con interfaz gráfica desarrollada en Tkinter y almacenamiento de datos en SQLite.",
      "LINK": "Ver en GitHub"
    },
    "3": {
      "TITLE": "Chatbot",
      "DESC": "El chatbot funciona detectando palabras clave en las entradas del usuario y respondiendo en base a ellas. Puede servir como base para implementar técnicas más avanzadas de procesamiento del lenguaje natural (NLP) o integrarse con modelos más complejos.",
      "LINK": "Ver en GitHub"
    }
  }
},

  
  "EXTRAS": {
    "TITLE": "Extras",
    "INTERESTS": {
      "TITLE": "Intereses",
      "TEXT": "Me gusta aprender nuevas tecnologías y experimentar con proyectos personales, explorando diferentes lenguajes, frameworks y herramientas que me permiten mejorar mis habilidades como desarrollador."
    },
  "LANGUAGES": {
    "TITLE": "Idiomas",
    "SPANISH": "Español",
    "ENGLISH": "Inglés",
    "LEVEL": {
      "SPANISH": "Nativo",
      "ENGLISH": "Nivel intermedio (B2)"
    }
  },
  "EVENTS": "Eventos",
  "EVENTS_LIST": [
    "He participado en la DrupalCon 2025 celebrada en Santiago de Compostela.",
    "He asistido a las jornadas de ciberseguridad CCN-CERT 2024 en Madrid.",
    "He asistido al t3chfest 2024 en Madrid."
  ],

  "RECOGNITIONS": {
    "TITLE": "Reconocimientos",
    "TEXT": "Reconocimiento en mis prácticas por destacar por mi capacidad para aprender rápidamente y mi disposición a asumir nuevos retos."
  },
  "CERTIFICATES": "Certificados",
  "CERTIFICATES_LIST": [
    "English for IT 2 – Cisco",
    "Desarrollo de aplicaciones con NodeJs y Express – Openwebinars",
    "Fundamentos de Angular – Openwebinars"
  ]
  ,
  "FOOTER": {
    "COPY": "© 2025 Marcos Bazán Fernández · Todos los derechos reservados."
  }}
}


